#### Terraform Format and Style - prod 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.snampo_prod.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=snampo-prod/cloudresourcemanager.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["apikeys.googleapis.com"]: Refreshing state... [id=snampo-prod/apikeys.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=snampo-prod/secretmanager.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=snampo-prod/artifactregistry.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=snampo-prod/sts.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=snampo-prod/run.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"]: Refreshing state... [id=snampo-prod/cloudbuild.googleapis.com]
module.snampo_prod.module.project_services.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=snampo-prod/storage.googleapis.com]
module.snampo_prod.module.service_account.google_service_account.service_accounts["snampo-prod-terraform"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.gcs_buckets.google_storage_bucket.buckets["snampo-prod-bucket"]: Refreshing state... [id=snampo-prod-bucket]
module.snampo_prod.module.workload_identity.google_iam_workload_identity_pool.pool["github"]: Refreshing state... [id=projects/snampo-prod/locations/global/workloadIdentityPools/github]
module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com:roles/owner"]: Refreshing state... [id=snampo-prod/roles/owner/serviceAccount:snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com]
module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-terraform:roles/iam.workloadIdentityUser"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-terraform:roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.snampo_prod.module.workload_identity.google_iam_workload_identity_pool_provider.gh_provider["nakamaware"]: Refreshing state... [id=projects/snampo-prod/locations/global/workloadIdentityPools/github/providers/nakamaware]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.snampo_prod.module.artifact_registry["snampo-prod"].google_artifact_registry_repository.repo will be created
  + resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Cloud Run Source Deployments"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "Docker"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "snampo-prod"
      + registry_uri           = (known after apply)
      + repository_id          = "snampo-prod"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete_policy"

          + condition {
              + older_than            = "7d"
              + package_name_prefixes = [
                  + "snampo",
                ]
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep_policy"

          + most_recent_versions {
              + keep_count            = 10
              + package_name_prefixes = [
                  + "snampo",
                ]
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.snampo_prod.module.cloud_run_service["snampo-prod-backend"].google_cloud_run_v2_service.default will be created
  + resource "google_cloud_run_v2_service" "default" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + invoker_iam_disabled    = true
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "snampo-prod-backend"
      + observed_generation     = (known after apply)
      + project                 = "snampo-prod"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling {
          + manual_instance_count = (known after apply)
          + max_instance_count    = 3
          + min_instance_count    = (known after apply)
        }

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "snampo-prod-run@snampo-prod.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/cloudrun/container/hello"

              + env {
                  + name  = "GOOGLE_API_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "google-api-key"
                          + version = "latest"
                        }
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling (known after apply)
        }

      + traffic (known after apply)
    }

  # module.snampo_prod.module.google_api_keys.google_apikeys_key.basic_key["google-api-key"] will be created
  + resource "google_apikeys_key" "basic_key" {
      + display_name = "google-api-key"
      + id           = (known after apply)
      + key_string   = (sensitive value)
      + name         = "google-api-key"
      + project      = "snampo-prod"
      + uid          = (known after apply)

      + restrictions {
          + api_targets {
              + service = "streetviewpublish.googleapis.com"
            }
          + api_targets {
              + service = "directions-backend.googleapis.com"
            }
        }
    }

  # module.snampo_prod.module.iam_members.google_project_iam_member.group_members["gcp-organization-developers@nakamaware.com:roles/viewer"] will be created
  + resource "google_project_iam_member" "group_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-organization-developers@nakamaware.com"
      + project = "snampo-prod"
      + role    = "roles/viewer"
    }

  # module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com:roles/artifactregistry.writer"] will be created
  + resource "google_project_iam_member" "sa_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com"
      + project = "snampo-prod"
      + role    = "roles/artifactregistry.writer"
    }

  # module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com:roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "sa_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com"
      + project = "snampo-prod"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com:roles/run.developer"] will be created
  + resource "google_project_iam_member" "sa_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com"
      + project = "snampo-prod"
      + role    = "roles/run.developer"
    }

  # module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-run@snampo-prod.iam.gserviceaccount.com:roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "sa_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:snampo-prod-run@snampo-prod.iam.gserviceaccount.com"
      + project = "snampo-prod"
      + role    = "roles/logging.logWriter"
    }

  # module.snampo_prod.module.iam_members.google_project_iam_member.sa_members["snampo-prod-run@snampo-prod.iam.gserviceaccount.com:roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "sa_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:snampo-prod-run@snampo-prod.iam.gserviceaccount.com"
      + project = "snampo-prod"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.snampo_prod.module.project_services.google_project_service.project_services["directions-backend.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "snampo-prod"
      + service                    = "directions-backend.googleapis.com"
    }

  # module.snampo_prod.module.project_services.google_project_service.project_services["maps-android-backend.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "snampo-prod"
      + service                    = "maps-android-backend.googleapis.com"
    }

  # module.snampo_prod.module.project_services.google_project_service.project_services["maps-backend.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "snampo-prod"
      + service                    = "maps-backend.googleapis.com"
    }

  # module.snampo_prod.module.project_services.google_project_service.project_services["maps-ios-backend.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "snampo-prod"
      + service                    = "maps-ios-backend.googleapis.com"
    }

  # module.snampo_prod.module.project_services.google_project_service.project_services["streetviewpublish.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "snampo-prod"
      + service                    = "streetviewpublish.googleapis.com"
    }

  # module.snampo_prod.module.secret_manager.google_secret_manager_secret.secrets["google-api-key"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "snampo-prod"
      + secret_id             = "google-api-key"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-northeast1"
                }
            }
        }
    }

  # module.snampo_prod.module.secret_manager.google_secret_manager_secret_version.secret-version["google-api-key"] will be created
  + resource "google_secret_manager_secret_version" "secret-version" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.snampo_prod.module.service_account.google_service_account.service_accounts["snampo-prod-cicd"] will be created
  + resource "google_service_account" "service_accounts" {
      + account_id   = "snampo-prod-cicd"
      + description  = "CI/CD用サービスアカウント"
      + disabled     = false
      + display_name = "snampo-prod-cicd"
      + email        = "snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:snampo-prod-cicd@snampo-prod.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "snampo-prod"
      + unique_id    = (known after apply)
    }

  # module.snampo_prod.module.service_account.google_service_account.service_accounts["snampo-prod-run"] will be created
  + resource "google_service_account" "service_accounts" {
      + account_id   = "snampo-prod-run"
      + description  = "Cloud Run用サービスアカウント"
      + disabled     = false
      + display_name = "snampo-prod-run"
      + email        = "snampo-prod-run@snampo-prod.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:snampo-prod-run@snampo-prod.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "snampo-prod"
      + unique_id    = (known after apply)
    }

  # module.snampo_prod.module.workload_identity.data.google_service_account.service_account["snampo-prod-cicd"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "service_account" {
      + account_id   = "snampo-prod-cicd"
      + disabled     = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "snampo-prod"
      + unique_id    = (known after apply)
    }

  # module.snampo_prod.module.workload_identity.data.google_service_account.service_account["snampo-prod-terraform"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "service_account" {
      + account_id   = "snampo-prod-terraform"
      + disabled     = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "snampo-prod"
      + unique_id    = (known after apply)
    }

  # module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-cicd:roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "sa_gh_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "principalSet://iam.googleapis.com/projects/734767447284/locations/global/workloadIdentityPools/github/attribute.repository/nakamaware/snampo",
        ]
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-cicd:roles/iam.workloadIdentityUser"] will be created
  + resource "google_service_account_iam_binding" "sa_gh_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "principalSet://iam.googleapis.com/projects/734767447284/locations/global/workloadIdentityPools/github/attribute.repository/nakamaware/snampo",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-terraform:roles/iam.serviceAccountTokenCreator"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZH9R51CWY=" -> (known after apply)
      ~ id                 = "projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> (known after apply)
      ~ service_account_id = "projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.snampo_prod.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-prod-terraform:roles/iam.workloadIdentityUser"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZH9R51CWY=" -> (known after apply)
      ~ id                 = "projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ service_account_id = "projects/snampo-prod/serviceAccounts/snampo-prod-terraform@snampo-prod.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 22 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @HZW1713, Action: `pull_request`, Working Directory: ``, Workflow: `CI - Terraform`*